package kr.co.goodee39.date1026;

public class Ex09Exchange {
	public static void main(String[] args) {
		int a = (int)67.4;
		System.out.println(a);
		int b = 'a';//97
		System.out.println(b);
		// 형변환
		/* - 형변환이란 변수 또는 리터럴의 타입을 다른 타입으로 변환하는 것
		 * - 연산을 하거나 변수에 넣을 값의 타입을 갖추지 않으면 에러가 날 수 있다.
		 * - 형 변환하고자 하는 변수나 리터럴 앞에 변환하고자 하는 타입을 괄호 안에 붙여주면 형변환이 된다.
		 * - 형 변환 시 사용된 괄호를 캐스팅연산자, 혹은 형변환 연산자라고 한다.
		 * - 8개의 기본형 중에서 boolean을 제외한 나머지 7개의 기본형 간에는 서로 형변환이 가능하다.
		 * - 범위가 큰 자료형에서 작은 자료형의 변환은 손실이 발생할 수 있다.
		 * - 반대로 작은 자료형에서 큰 자료형으로 변환하는 경우에는 값 손실이 발생하지 않으므로 변환에 아무런 문제가 없다.
		 * - 작은 자료형에서 큰 자료형으로 변환하는 경우 캐스팅 연산자 생략이 가능하다.
		 * */
	}
}	
